#### 📖 Terraform Plan ('src/core/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
azurerm_resource_group.dashboards_weu: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_resource_group.dashboards_weu will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards")
  ~ resource "azurerm_resource_group" "dashboards_weu" {
        id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
        location   = "westeurope"
        managed_by = null
        name       = "dashboards"
      ~ tags       = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
    }

  # azurerm_role_assignment.dashboards_auth_admins will be created
  + resource "azurerm_role_assignment" "dashboards_auth_admins" {
      + description                      = "Allow IO Auth admins to manage dashboards"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "912c0ba1-90b5-47eb-83f7-bf1e1294cd5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Opex Dashboards Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dashboards_auth_devs will be created
  + resource "azurerm_role_assignment" "dashboards_auth_devs" {
      + description                      = "Allow IO Auth admins to manage dashboards"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0bd8a47e-3188-45c9-9c74-23f22fca2497"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Opex Dashboards Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dashboards_bonus_admins will be created
  + resource "azurerm_role_assignment" "dashboards_bonus_admins" {
      + description                      = "Allow IO Bonus admins to manage dashboards"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "831e5214-2f68-4a13-b25f-7bec962c7e1b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Opex Dashboards Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dashboards_bonus_devs will be created
  + resource "azurerm_role_assignment" "dashboards_bonus_devs" {
      + description                      = "Allow IO Bonus admins to manage dashboards"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "861e7fd4-6463-4f69-b473-1e6aaaa4520e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Opex Dashboards Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dashboards_com_admins will be created
  + resource "azurerm_role_assignment" "dashboards_com_admins" {
      + description                      = "Allow IO COM admins to manage dashboards"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "12a48460-7d95-4d91-ab0a-1d19008aac2c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Opex Dashboards Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dashboards_com_devs will be created
  + resource "azurerm_role_assignment" "dashboards_com_devs" {
      + description                      = "Allow IO COM admins to manage dashboards"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b78851b-c40d-497d-ae7f-596b8f92ecf2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Opex Dashboards Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dashboards_svc_admins will be created
  + resource "azurerm_role_assignment" "dashboards_svc_admins" {
      + description                      = "Allow IO SVC admins to manage dashboards"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "100cb2bb-92d5-40ad-bfa9-1d3c676f13e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Opex Dashboards Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dashboards_svc_devs will be created
  + resource "azurerm_role_assignment" "dashboards_svc_devs" {
      + description                      = "Allow IO SVC admins to manage dashboards"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "300ea154-9984-4712-85e9-3abcb3e42960"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Opex Dashboards Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dashboards_wallet_admins will be created
  + resource "azurerm_role_assignment" "dashboards_wallet_admins" {
      + description                      = "Allow IO Wallet admins to manage dashboards"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Opex Dashboards Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dashboards_wallet_devs will be created
  + resource "azurerm_role_assignment" "dashboards_wallet_devs" {
      + description                      = "Allow IO Wallet admins to manage dashboards"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b2ca23d9-ace5-416d-8132-01d9b002db12"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Opex Dashboards Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/dashboards"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to import, 10 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.azdoa_weu.module.azdoa_snet.azurerm_subnet.this,
  on .terraform/modules/azdoa_weu.azdoa_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 11 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
